## Decision Tree 
### Our objective is - Use decision trees to prepare a model on fraud data treating those who have taxable_income <= 30000 as "Risky" and others are "Good"

In [4]:
#libraries
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier

In [71]:
df = pd.read_csv("G:\Github\DS-assignments-python\Decision Tree\Fraud_check.csv")

In [7]:
df.shape

(600, 6)

In [8]:
df.head(10)

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO
5,NO,Divorced,33329,116382,0,NO
6,NO,Divorced,83357,80890,8,YES
7,YES,Single,62774,131253,3,YES
8,NO,Single,83519,102481,12,YES
9,YES,Divorced,98152,155482,4,YES

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int32
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int32(1), int64(2), object(3)
memory usage: 25.9+ KB

In [9]:
df.columns

Index(['Undergrad', 'Marital.Status', 'Taxable.Income', 'City.Population',
       'Work.Experience', 'Urban'],
      dtype='object')

In [12]:
#dumm

In [15]:
#axis{0 or ‘index’, 1 or ‘columns’}, default 0
#Axis along which the function is applied:

#0 or ‘index’: apply function to each column.

#1 or ‘columns’: apply function to each row.

In [32]:
#df[df['Taxable.Income'] <= 30000]['Taxable.Income'] = 0
#df[df['Taxable.Income'] > 30000]['Taxable.Income'] = 1
#the above approch doesn't work...cause deson;t repace any values

In [70]:
type(df.index)

pandas.core.indexes.range.RangeIndex

In [67]:
'''one way to do it shown below...
for i in list(df.index):
    if df.iloc[i,2]<30000:
        df.iloc[i,2] = 0
    else:
        df.iloc[i,2] = 1
'''

In [72]:
# best one liners in coding to map dual values baby --
df["Taxable.Income"] = pd.Series(np.where(df["Taxable.Income"]<=30000,0,1),df.index)

In [73]:
df.iloc[:,2].unique

<bound method Series.unique of 0      1
1      1
2      1
3      1
4      1
      ..
595    1
596    1
597    1
598    1
599    1
Name: Taxable.Income, Length: 600, dtype: int32>

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int32
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int32(1), int64(2), object(3)
memory usage: 25.9+ KB